In [1]:
from MySQLdb import connect
import pandas as pd

/var/folders/fb/xl0hnskx527bfqkv38l3sn7h0000gn/T/ipykernel_30978/3687392072.py:2: DeprecationWarning:
Pyarrow will become a required dependency of pandas in the next major release of pandas (pandas 3.0),
(to allow more performant data types, such as the Arrow string type, and better interoperability with other libraries)
but was not found to be installed on your system.
If this would cause problems for you,
please provide us feedback at https://github.com/pandas-dev/pandas/issues/54466

  import pandas as pd

In [2]:
# Connect to your MySQLdb
#conn = connect(host='localhost', user='root')
conn = connect(host='127.0.0.1', user='root', password = 'root', port = 8890)

In [3]:
# Open a cursor to perform database operations
cur = conn.cursor()

In [4]:
# Return data from the Customers table:
cur.execute('''SHOW DATABASES;''')
df = pd.DataFrame(tuple(t) for t in cur.fetchall())
df.columns = [i[0] for i in cur.description]
df

             Database
0  information_schema
1               mysql
2  performance_schema
3              sqlw3s
4                 sys
5              testDB

### SQL Constraints
- SQL constraints are used to specify rules for data in a table.

SQL Create Constraints
- Constraints can be specified when the table is created with the CREATE TABLE statement, or after the table is created with the ALTER TABLE statement.

>Syntax
>
>CREATE TABLE table_name (
>
>    column1 datatype constraint,
>
>    column2 datatype constraint,
>
>    column3 datatype constraint,
>
>    ....
>
>);

SQL Constraints
- SQL constraints are used to specify rules for the data in a table.
- Constraints are used to limit the type of data that can go into a table. This ensures the accuracy and reliability of the data in the table. If there is any violation between the constraint and the data action, the action is aborted.
- Constraints can be column level or table level. Column level constraints apply to a column, and table level constraints apply to the whole table.

The following constraints are commonly used in SQL:

${\color{red}NOT}$ ${\color{red}NULL}$ - Ensures that a column cannot have a NULL value

${\color{red}UNIQUE}$ - Ensures that all values in a column are different

${\color{red}PRIMARY}$ ${\color{red}KEY}$ - A combination of a NOT NULL and UNIQUE. Uniquely identifies each row in a table

${\color{red}FOREIGN}$ ${\color{red}KEY}$ - Prevents actions that would destroy links between tables

${\color{red}CHECK}$ - Ensures that the values in a column satisfies a specific condition

${\color{red}DEFAULT}$ - Sets a default value for a column if no value is specified

${\color{red}CREATE}$ ${\color{red}INDEX}$ - Used to create and retrieve data from the database very quickly

In [18]:
# The following SQL adds an "Email" column to the "Customers" table:
cur.execute('''ALTER TABLE testDB.CustomersNew ADD CONSTRAINT pk_customer_id PRIMARY KEY (CustomerID);''')

0

In [19]:
# The following SQL adds an "Email" column to the "Customers" table:
cur.execute('''ALTER TABLE testDB.CustomersNew ADD CONSTRAINT fk_customer_id FOREIGN KEY (CustomerID) REFERENCES testDB.Customers(CustomerID);''')

91

In [6]:
# Return data from the CustomersNew table:
cur.execute('''SELECT * FROM testDB.CustomersNew;''')
df = pd.DataFrame(tuple(t) for t in cur.fetchall())
columns = [i[0] for i in cur.description]
if len(df) == 0: df = pd.DataFrame([["" for i in range(len(columns))]])
df.columns = columns
df

,CustomerID,CustomerName,ContactName,Address,City,PostalCode,Country
0,1,Alfreds Futterkiste,Maria Anders,Obere Str. 57,Berlin,12209,Germany
1,2,Ana Trujillo Emparedados y helados,Ana Trujillo,Avda. de la Constitución 2222,México D.F.,05021,Mexico
2,3,Antonio Moreno Taquería,Antonio Moreno,Mataderos 2312,México D.F.,05023,Mexico
3,4,Around the Horn,Thomas Hardy,120 Hanover Sq.,London,WA1 1DP,UK
4,5,Berglunds snabbköp,Christina Berglund,Berguvsvägen 8,Luleå,S-958 22,Sweden
...,...,...,...,...,...,...,...
86,87,Wartian Herkku,Pirkko Koskitalo,Torikatu 38,Oulu,90110,Finland
87,88,Wellington Importadora,Paula Parente,"Rua do Mercado, 12",Resende,08737-363,Brazil
88,89,White Clover Markets,Karl Jablonski,305 - 14th Ave. S. Suite 3B,Seattle,98128,USA
89,90,Wilman Kala,Matti Karttunen,Keskuskatu 45,Helsinki,21240,Finland
90,91,Wolski,Zbyszek,ul. Filtrowa 68,Walla,01-012,Poland

In [21]:
# ALTER TABLE table_name MODIFY column_name new_column_datatype [constraints]
cur.execute('''ALTER TABLE testDB.CustomersNew MODIFY CustomerName varchar(255) NOT NULL;''')

0

In [22]:
cur.execute('''UPDATE testDB.CustomersNew SET CustomerName = NULL;''')

IntegrityError: (1048, "Column 'CustomerName' cannot be null")

In [5]:
cur.execute('''ALTER TABLE testDB.CustomersNew ADD INDEX customer_id_index (CustomerID);''')

0

In [7]:
# Return data from the CustomersNew table:
cur.execute('''DESCRIBE testDB.CustomersNew;''')
df = pd.DataFrame(tuple(t) for t in cur.fetchall())
columns = [i[0] for i in cur.description]
if len(df) == 0: df = pd.DataFrame([["" for i in range(len(columns))]])
df.columns = columns
df

          Field              Type Null  Key Default Extra
0    CustomerID  int(10) unsigned   NO  PRI    None
1  CustomerName      varchar(255)   NO         None
2   ContactName      varchar(255)  YES         None
3       Address      varchar(255)  YES         None
4          City      varchar(255)  YES         None
5    PostalCode      varchar(255)  YES         None
6       Country      varchar(255)  YES         None

In [8]:
# Return data from the Customers table:
cur.execute('''DESCRIBE testDB.Customers;''')
df = pd.DataFrame(tuple(t) for t in cur.fetchall())
columns = [i[0] for i in cur.description]
if len(df) == 0: df = pd.DataFrame([["" for i in range(len(columns))]])
df.columns = columns
df

          Field              Type Null  Key Default Extra
0    CustomerID  int(10) unsigned   NO  PRI    None
1  CustomerName      varchar(255)  YES         None
2   ContactName      varchar(255)  YES         None
3       Address      varchar(255)  YES         None
4          City      varchar(255)  YES         None
5    PostalCode      varchar(255)  YES         None
6       Country      varchar(255)  YES         None